<?xml version="1.0" ?>
<net name="frozen" version="7">
	<layers>
		<layer id="0" name="x" type="Input" version="opset1">
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="AllDS2020_TF_CNN/conv2d/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" group="1" kernel="5,5" output="30" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" precision="FP32" size="9000"/>
				<biases offset="9000" precision="FP32" size="120"/>
			</blobs>
		</layer>
		<layer id="2" name="AllDS2020_TF_CNN/conv2d/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="AllDS2020_TF_CNN/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" group="1" kernel="5,5" output="30" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9120" precision="FP32" size="90000"/>
				<biases offset="99120" precision="FP32" size="120"/>
			</blobs>
		</layer>
		<layer id="4" name="AllDS2020_TF_CNN/conv2d_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="AllDS2020_TF_CNN/max_pooling2d/MaxPool" type="Pooling" version="opset1">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="AllDS2020_TF_CNN/max_pooling2d/MaxPool/Transpose" type="Permute" version="opset1">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>50</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="AllDS2020_TF_CNN/flatten/Reshape/Cast_1856_const" type="Const" version="opset1">
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="99240" precision="I32" size="8"/>
			</blobs>
		</layer>
		<layer id="8" name="AllDS2020_TF_CNN/flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="False"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>50</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>75000</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="AllDS2020_TF_CNN/dense/MatMul" type="FullyConnected" version="opset1">
			<data out-size="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>75000</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="99248" precision="FP32" size="600000"/>
				<biases offset="699248" precision="FP32" size="8"/>
			</blobs>
		</layer>
		<layer id="10" name="AllDS2020_TF_CNN/activation/Softmax" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value=""/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="True"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR\frozen.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,100,100,3]"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="frozen"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[  1 100 100   3]"/>
			<progress value="False"/>
			<reverse_input_channels value="True"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
